#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

int main()
{
	int a = 9;
	printf("%d\n", a);
	return 0;
}





//int main()
//{
//	int a=10;
//	//int b=a++;//后置++，先使用，再++;11,10，a先赋予b，a再+1；11，10
//	//int b=a--;//后置--，先使用，再--;11,10，a先赋予b，a再+1；9，10
//	//int b=++a;//前置++，先++，再使用;11,11，a先+1，再将相加后的结果赋予b，再加一；11，11
//	//int b=--a;//前置--，先--，再使用;11,11，a先+1，再将相加后的结果赋予b，再加一；9，9
//	int b=a++;
//	printf("a=%d b=%d\n",a,b);
//	return 0;
//}


//int main()
//{
//	int a=0;
//	int b=~a;//按位取反
//	printf("%d\n",b);//在使用打印时用的是这个数的原码
//	//原码、反码、补码
//	//00000000000000000000000000000000:a
//	//11111111111111111111111111111111:b取反得到的补码
//	//11111111111111111111111111111110:b的反码
//	//10000000000000000000000000000001:b的原码，十进制为-1
//	//整型的第一位是负号位，0是正号，1是负号
//	//负数在储存的时候，储存的是二进制的补码
//	//原码符号位不变，其余各位按位取反，得到反码；反码加一得补码
//	//反过来，补码减一得反码；反码符号位不变，其余各位取反得原码
//	return 0;
//}